src/DataProcessors/Демо_КОД_Обработчик_МаршрутизаторЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Демо_КОД_Обработчик_МаршрутизаторЗаказов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/Демо_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Демо_Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Демо_КОД_СкладыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Демо_КОД_Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/Демо_КОД_Обработчик_МаршрутизаторЗаказов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСпискиВыбора(Метаданные.Документы.Демо_Заказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПланОбменаПолноеИмяПриИзменении(Элемент)
	ЗаполнитьСписокКонвейеровНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьМаршрутизацию(Команда)
	ВыполнитьМаршрутизациюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьМаршрутизациюНаСервере()

	МетаданныеПланаОбмена = Метаданные.НайтиПоПолномуИмени(ПланОбменаПолноеИмя);
	МетаданныеКонвейера = Метаданные.НайтиПоПолномуИмени(КонвейерПолноеИмя);
	ОбъектМетаданных = Метаданные.Документы.Демо_Заказ;
	Сценарий = НайтиСценарий(МетаданныеПланаОбмена, ОбъектМетаданных, МетаданныеКонвейера);
	Если Сценарий = Неопределено Тогда
		ВызватьИсключение "Сценарий выполнения не найден.";
	КонецЕсли;

	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Конвейер = КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбъектОбработки(МетаданныеКонвейера);
	Контекст = Конвейер.НовыйКонтекстВыполнения(Сценарий, МассивСсылок, ОбъектМетаданных,
		МетаданныеПланаОбмена, МенеджерВременныхТаблиц, "Отладка");

	ПодготовитьСсылкиПослеФильтра(Контекст, МассивСсылок);

	Обработчик = РеквизитФормыВЗначение("Объект");
	Обработчик.Обработать(Контекст);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СсылкиПоУзлам.Узел КАК Узел,
		|	СсылкиПоУзлам.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_СсылкиПоУзлам КАК СсылкиПоУзлам";
	Результат.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокКонвейеровНаСервере()
	ЗаполнитьСписокКонвейеров(Метаданные.Документы.Демо_Заказ);
КонецПроцедуры

// Заполняет списки выбора планов обмена и конвейеров по реестрам сценариев.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого отбираются сценарии.
//
&НаСервере
Процедура ЗаполнитьСпискиВыбора(ОбъектМетаданных)

	СписокВыбораПланов = Элементы.ПланОбменаПолноеИмя.СписокВыбора;
	СписокВыбораПланов.Очистить();

	СоответствиеРеестров = КОД_ДиспетчерРегистрацииКОбмену.РеестрыСценариевПоПланамОбмена();
	Для Каждого ПланОбменаИРеестр Из СоответствиеРеестров Цикл
		РеестрСценариев = КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбъектОбработки(
			ПланОбменаИРеестр.Значение).РеестрКонвейеровРегистрации();
		МассивСценариев = РеестрСценариев[ОбъектМетаданных];
		Если МассивСценариев = Неопределено Или МассивСценариев.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		МетаданныеПланаОбмена = ПланОбменаИРеестр.Ключ;
		ПредставлениеПланаОбмена = ?(ПустаяСтрока(МетаданныеПланаОбмена.Синоним),
			МетаданныеПланаОбмена.Имя, МетаданныеПланаОбмена.Синоним);
		СписокВыбораПланов.Добавить(МетаданныеПланаОбмена.ПолноеИмя(), ПредставлениеПланаОбмена);
	КонецЦикла;

	Если СписокВыбораПланов.Количество() = 0 Тогда
		ПланОбменаПолноеИмя = "";
		КонвейерПолноеИмя = "";
		Элементы.КонвейерПолноеИмя.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;

	Если СписокВыбораПланов.НайтиПоЗначению(ПланОбменаПолноеИмя) = Неопределено Тогда
		ПланОбменаПолноеИмя = СписокВыбораПланов.Получить(0).Значение;
	КонецЕсли;

	ЗаполнитьСписокКонвейеров(ОбъектМетаданных);

КонецПроцедуры

// Заполняет список выбора конвейеров для выбранного плана обмена.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого отбираются сценарии.
//
&НаСервере
Процедура ЗаполнитьСписокКонвейеров(ОбъектМетаданных)

	СписокВыбораКонвейеров = Элементы.КонвейерПолноеИмя.СписокВыбора;
	СписокВыбораКонвейеров.Очистить();

	МетаданныеПланаОбмена = Метаданные.НайтиПоПолномуИмени(ПланОбменаПолноеИмя);
	МассивСценариев = ПолучитьСценарииРегистрации(МетаданныеПланаОбмена, ОбъектМетаданных);
	Если МассивСценариев <> Неопределено Тогда
		Для Каждого Сценарий Из МассивСценариев Цикл
			ПолноеИмяКонвейера = Сценарий.Конвейер.ПолноеИмя();
			Если СписокВыбораКонвейеров.НайтиПоЗначению(ПолноеИмяКонвейера) = Неопределено Тогда
				ПредставлениеКонвейера = ?(ПустаяСтрока(Сценарий.Конвейер.Синоним),
					Сценарий.Конвейер.Имя, Сценарий.Конвейер.Синоним);
				СписокВыбораКонвейеров.Добавить(ПолноеИмяКонвейера, ПредставлениеКонвейера);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если СписокВыбораКонвейеров.Количество() = 0 Тогда
		КонвейерПолноеИмя = "";
	ИначеЕсли СписокВыбораКонвейеров.НайтиПоЗначению(КонвейерПолноеИмя) = Неопределено Тогда
		КонвейерПолноеИмя = СписокВыбораКонвейеров.Получить(0).Значение;
	КонецЕсли;

КонецПроцедуры

// Возвращает сценарии регистрации объекта для плана обмена.
//
// Параметры:
//  МетаданныеПланаОбмена - ОбъектМетаданныхПланОбмена, Неопределено - план обмена.
//  ОбъектМетаданных      - ОбъектМетаданных - регистрируемый объект.
//
// Возвращаемое значение:
//  Массив, Неопределено - сценарии регистрации объекта.
//
&НаСервере
Функция ПолучитьСценарииРегистрации(МетаданныеПланаОбмена, ОбъектМетаданных)

	Если МетаданныеПланаОбмена = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	СоответствиеРеестров = КОД_ДиспетчерРегистрацииКОбмену.РеестрыСценариевПоПланамОбмена();
	МетаданныеОбработкиРеестра = СоответствиеРеестров[МетаданныеПланаОбмена];
	Если МетаданныеОбработкиРеестра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	РеестрСценариев = КОД_ДиспетчерРегистрацииКОбмену.ПолучитьОбъектОбработки(
		МетаданныеОбработкиРеестра).РеестрКонвейеровРегистрации();

	Возврат РеестрСценариев[ОбъектМетаданных];

КонецФункции

// Возвращает сценарий регистрации для выбранного конвейера.
//
// Параметры:
//  МетаданныеПланаОбмена - ОбъектМетаданныхПланОбмена - план обмена.
//  ОбъектМетаданных      - ОбъектМетаданных - регистрируемый объект.
//  МетаданныеКонвейера   - ОбъектМетаданныхОбработка - конвейер обработчиков.
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура, Неопределено - найденный сценарий.
//
&НаСервере
Функция НайтиСценарий(МетаданныеПланаОбмена, ОбъектМетаданных, МетаданныеКонвейера)

	МассивСценариев = ПолучитьСценарииРегистрации(МетаданныеПланаОбмена, ОбъектМетаданных);
	Если МассивСценариев = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Для Каждого Сценарий Из МассивСценариев Цикл
		Если Сценарий.Конвейер = МетаданныеКонвейера Тогда
			Возврат Сценарий;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Помещает переданные ссылки во временную таблицу после фильтрации.
//
// Параметры:
//  Контекст      - ФиксированнаяСтруктура - контекст выполнения конвейера.
//  МассивСсылок - Массив - ссылки на заказы.
//
&НаСервере
Процедура ПодготовитьСсылкиПослеФильтра(Контекст, МассивСсылок)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Ссылка,
		|	Заказы.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ_СсылкиПослеФильтра
		|ИЗ
		|	Документ.Демо_Заказ КАК Заказы
		|ГДЕ
		|	Заказы.Ссылка В (&МассивСсылок)";
	Запрос.Выполнить();

КонецПроцедуры

#КонецОбласти
